## Importing the libraries

In [1]:
import pandas as pd 
import numpy as np
import pymysql
from sqlalchemy import create_engine

df = pd.read_csv('credit_card_transactions - India.csv')

## Analysis of Dataset

In [2]:
df.head()

   index                   City       Date  Card Type Exp Type Gender  Amount
0      0           Delhi, India  29-Oct-14       Gold    Bills      F   82475
1      1  Greater Mumbai, India  22-Aug-14   Platinum    Bills      F   32555
2      2       Bengaluru, India  27-Aug-14     Silver    Bills      F  101738
3      3  Greater Mumbai, India  12-Apr-14  Signature    Bills      F  123424
4      4       Bengaluru, India   5-May-15       Gold    Bills      F  171574

In [3]:
df.describe()

              index         Amount
count  26052.000000   26052.000000
mean   13025.500000  156411.537425
std     7520.708943  103063.254287
min        0.000000    1005.000000
25%     6512.750000   77120.250000
50%    13025.500000  153106.500000
75%    19538.250000  228050.000000
max    26051.000000  998077.000000

In [4]:
df.info()

df.shape

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26052 entries, 0 to 26051
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   index      26052 non-null  int64
 1   City       26052 non-null  object
 2   Date       26052 non-null  object
 3   Card Type  26052 non-null  object
 4   Exp Type   26052 non-null  object
 5   Gender     26052 non-null  object
 6   Amount     26052 non-null  int64
dtypes: int64(2), object(5)
memory usage: 1.4+ MB

(26052, 7)

In [5]:
df.duplicated().sum()

np.int64(0)

## Standardizing and Cleaning Data

In [6]:
df['Date'] = pd.to_datetime(df['Date'])

df['Date_as_int'] = df['Date'].dt.strftime('%Y%m%d')

df.Date

C:\Users\Cosmoos\AppData\Local\Temp\ipykernel_8228\576849038.py:1: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  df['Date'] = pd.to_datetime(df['Date'])

0       2014-10-29
1       2014-08-22
2       2014-08-27
3       2014-04-12
4       2015-05-05
           ...
26047   2014-06-22
26048   2014-08-03
26049   2015-01-16
26050   2014-09-14
26051   2013-10-19
Name: Date, Length: 26052, dtype: datetime64[ns]

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26052 entries, 0 to 26051
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   index        26052 non-null  int64
 1   City         26052 non-null  object
 2   Date         26052 non-null  datetime64[ns]
 3   Card Type    26052 non-null  object
 4   Exp Type     26052 non-null  object
 5   Gender       26052 non-null  object
 6   Amount       26052 non-null  int64
 7   Date_as_int  26052 non-null  object
dtypes: datetime64[ns](1), int64(2), object(5)
memory usage: 1.6+ MB

In [8]:
# Seprating the years from the Date Column

df['Date'] = pd.to_datetime(df['Date'])

df['Year'] = df['Date'].dt.year

print(df)

       index                   City       Date  Card Type Exp Type Gender  \
0          0           Delhi, India 2014-10-29       Gold    Bills      F
1          1  Greater Mumbai, India 2014-08-22   Platinum    Bills      F
2          2       Bengaluru, India 2014-08-27     Silver    Bills      F
3          3  Greater Mumbai, India 2014-04-12  Signature    Bills      F
4          4       Bengaluru, India 2015-05-05       Gold    Bills      F
...      ...                    ...        ...        ...      ...    ...
26047  26047         Kolkata, India 2014-06-22     Silver   Travel      F
26048  26048            Pune, India 2014-08-03  Signature   Travel      M
26049  26049       Hyderabad, India 2015-01-16     Silver   Travel      M
26050  26050          Kanpur, India 2014-09-14     Silver   Travel      M
26051  26051       Hyderabad, India 2013-10-19  Signature    Bills      M

       Amount Date_as_int  Year
0       82475    20141029  2014
1       32555    20140822  2014
2      101738    20140827  2014
3      123424    20140412  2014
4      171574    20150505  2015
...       ...         ...   ...
26047  128191    20140622  2014
26048  246316    20140803  2014
26049  265019    20150116  2015
26050   88174    20140914  2014
26051  184410    20131019  2013

[26052 rows x 9 columns]

In [9]:
# Seprating the Country from the City Column

df['Country'] = df['City'].apply(lambda x: x.split(', ')[1] if ', ' in x else None)
df['City'] = df['City'].apply(lambda x: x.split(', ')[0] if ', ' in x else x)

print(df)

       index            City       Date  Card Type Exp Type Gender  Amount  \
0          0           Delhi 2014-10-29       Gold    Bills      F   82475
1          1  Greater Mumbai 2014-08-22   Platinum    Bills      F   32555
2          2       Bengaluru 2014-08-27     Silver    Bills      F  101738
3          3  Greater Mumbai 2014-04-12  Signature    Bills      F  123424
4          4       Bengaluru 2015-05-05       Gold    Bills      F  171574
...      ...             ...        ...        ...      ...    ...     ...
26047  26047         Kolkata 2014-06-22     Silver   Travel      F  128191
26048  26048            Pune 2014-08-03  Signature   Travel      M  246316
26049  26049       Hyderabad 2015-01-16     Silver   Travel      M  265019
26050  26050          Kanpur 2014-09-14     Silver   Travel      M   88174
26051  26051       Hyderabad 2013-10-19  Signature    Bills      M  184410

      Date_as_int  Year Country
0        20141029  2014   India
1        20140822  2014   India
2        20140827  2014   India
3        20140412  2014   India
4        20150505  2015   India
...           ...   ...     ...
26047    20140622  2014   India
26048    20140803  2014   India
26049    20150116  2015   India
26050    20140914  2014   India
26051    20131019  2013   India

[26052 rows x 10 columns]

In [10]:
df.info()

df.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26052 entries, 0 to 26051
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   index        26052 non-null  int64
 1   City         26052 non-null  object
 2   Date         26052 non-null  datetime64[ns]
 3   Card Type    26052 non-null  object
 4   Exp Type     26052 non-null  object
 5   Gender       26052 non-null  object
 6   Amount       26052 non-null  int64
 7   Date_as_int  26052 non-null  object
 8   Year         26052 non-null  int32
 9   Country      26052 non-null  object
dtypes: datetime64[ns](1), int32(1), int64(2), object(6)
memory usage: 1.9+ MB

,index,City,Date,Card Type,Exp Type,Gender,Amount,Date_as_int,Year,Country
0,0,Delhi,2014-10-29,Gold,Bills,F,82475,20141029,2014,India
1,1,Greater Mumbai,2014-08-22,Platinum,Bills,F,32555,20140822,2014,India
2,2,Bengaluru,2014-08-27,Silver,Bills,F,101738,20140827,2014,India
3,3,Greater Mumbai,2014-04-12,Signature,Bills,F,123424,20140412,2014,India
4,4,Bengaluru,2015-05-05,Gold,Bills,F,171574,20150505,2015,India

## Removing Index Column

In [11]:
df = df.drop(columns=['index'])

print(df)

                 City       Date  Card Type Exp Type Gender  Amount  \
0               Delhi 2014-10-29       Gold    Bills      F   82475
1      Greater Mumbai 2014-08-22   Platinum    Bills      F   32555
2           Bengaluru 2014-08-27     Silver    Bills      F  101738
3      Greater Mumbai 2014-04-12  Signature    Bills      F  123424
4           Bengaluru 2015-05-05       Gold    Bills      F  171574
...               ...        ...        ...      ...    ...     ...
26047         Kolkata 2014-06-22     Silver   Travel      F  128191
26048            Pune 2014-08-03  Signature   Travel      M  246316
26049       Hyderabad 2015-01-16     Silver   Travel      M  265019
26050          Kanpur 2014-09-14     Silver   Travel      M   88174
26051       Hyderabad 2013-10-19  Signature    Bills      M  184410

      Date_as_int  Year Country
0        20141029  2014   India
1        20140822  2014   India
2        20140827  2014   India
3        20140412  2014   India
4        20150505  2015   India
...           ...   ...     ...
26047    20140622  2014   India
26048    20140803  2014   India
26049    20150116  2015   India
26050    20140914  2014   India
26051    20131019  2013   India

[26052 rows x 9 columns]

## Saving the Cleaned and Standardized File in to .csv format

In [12]:
df.to_csv('cleaned_data.csv', index=False)

## Connecting to SQl

In [13]:
engine_sql = create_engine('mysql+pymysql://root:Cosmos.90@localhost:3306/credit_card_db')

In [14]:
df.to_sql(name='credit_card', con=engine_sql, if_exists='replace', index=False)

26052

# --- END ---